RefClient/bin/Debug/client.svclog

<E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-05-30T14:47:04.3149038Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{00000000-0000-0000-0000-000000000000}" /><Execution ProcessName="RefClient.vshost" ProcessID="4100" ThreadID="7" /><Channel/><Computer>NPOPOV</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-05-30T17:47:04.0856064+03:00" Source="ServiceLevelSendRequest" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo+yFIUNMZMdDr522VQwtuyUAAAAAamLm99+C2ka+Mga6I5LwxA8cm1RGFYBKpP/gpfS5rHMACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://rwsreftool/IRefService/matchByName</Action></s:Header><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><matchByName xmlns="http://rwsreftool/"><reftype xmlns="">ris_idx</reftype><name xmlns="">This is just a request!</name></matchByName></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-05-30T14:47:04.3890514Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{00000000-0000-0000-0000-000000000000}" /><Execution ProcessName="RefClient.vshost" ProcessID="4100" ThreadID="7" /><Channel/><Computer>NPOPOV</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-05-30T17:47:04.3890514+03:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://rwsreftool/IRefService/matchByName</Action><To>https://localhost:8001/RefService/</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo+yFIUNMZMdDr522VQwtuyUAAAAAamLm99+C2ka+Mga6I5LwxA8cm1RGFYBKpP/gpfS5rHMACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><matchByName xmlns="http://rwsreftool/"><reftype xmlns="">ris_idx</reftype><name xmlns="">This is just a request!</name></matchByName></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-05-30T14:47:04.6712506Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{00000000-0000-0000-0000-000000000000}" /><Execution ProcessName="RefClient.vshost" ProcessID="4100" ThreadID="7" /><Channel/><Computer>NPOPOV</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-05-30T17:47:04.6692486+03:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>340</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Mon, 30 May 2016 14:47:04 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><matchByNameResponse xmlns="http://rwsreftool/"><recCount xmlns="">0</recCount><name xmlns="">This is just a response!</name></matchByNameResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-05-30T14:47:04.6812571Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{00000000-0000-0000-0000-000000000000}" /><Execution ProcessName="RefClient.vshost" ProcessID="4100" ThreadID="7" /><Channel/><Computer>NPOPOV</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-05-30T17:47:04.6812571+03:00" Source="ServiceLevelReceiveReply" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>340</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Mon, 30 May 2016 14:47:04 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><matchByNameResponse xmlns="http://rwsreftool/"><recCount xmlns="">0</recCount><name xmlns="">This is just a response!</name></matchByNameResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-05-30T14:59:58.5685279Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{00000000-0000-0000-0000-000000000000}" /><Execution ProcessName="RefClient.vshost" ProcessID="2808" ThreadID="10" /><Channel/><Computer>NPOPOV</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-05-30T17:59:58.3154047+03:00" Source="ServiceLevelSendRequest" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo5jGUkKyWVFIohzDwCXZblkAAAAAlTv27GfoGkqMgzFHLVFq9XKOgd+X421CgX6ifx/NmFYACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://rwsreftool/IRefService/matchByName</Action></s:Header><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><matchByName xmlns="http://rwsreftool/"><reftype xmlns="">ris_idx</reftype><name xmlns="">This is just a request!</name></matchByName></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-05-30T14:59:58.6154065Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{00000000-0000-0000-0000-000000000000}" /><Execution ProcessName="RefClient.vshost" ProcessID="2808" ThreadID="10" /><Channel/><Computer>NPOPOV</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-05-30T17:59:58.6154065+03:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://rwsreftool/IRefService/matchByName</Action><To>https://localhost:8001/RefService/</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo5jGUkKyWVFIohzDwCXZblkAAAAAlTv27GfoGkqMgzFHLVFq9XKOgd+X421CgX6ifx/NmFYACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><matchByName xmlns="http://rwsreftool/"><reftype xmlns="">ris_idx</reftype><name xmlns="">This is just a request!</name></matchByName></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-05-30T14:59:58.9137667Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{00000000-0000-0000-0000-000000000000}" /><Execution ProcessName="RefClient.vshost" ProcessID="2808" ThreadID="10" /><Channel/><Computer>NPOPOV</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-05-30T17:59:58.9107646+03:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>545</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Mon, 30 May 2016 14:59:58 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="e634c56e-caeb-49f9-890b-7ccb0c2baaf6" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">4e83866b-a38b-43c3-b40a-becc30e09b5e</ActivityId></s:Header><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><matchByNameResponse xmlns="http://rwsreftool/"><recCount xmlns="">0</recCount><name xmlns="">This is just a response!</name></matchByNameResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2016-05-30T14:59:58.9257749Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{00000000-0000-0000-0000-000000000000}" /><Execution ProcessName="RefClient.vshost" ProcessID="2808" ThreadID="10" /><Channel/><Computer>NPOPOV</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2016-05-30T17:59:58.9257749+03:00" Source="ServiceLevelReceiveReply" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>545</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Mon, 30 May 2016 14:59:58 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="e634c56e-caeb-49f9-890b-7ccb0c2baaf6" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">4e83866b-a38b-43c3-b40a-becc30e09b5e</ActivityId></s:Header><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><matchByNameResponse xmlns="http://rwsreftool/"><recCount xmlns="">0</recCount><name xmlns="">This is just a response!</name></matchByNameResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent>